keith72632/STM32F407xx-Drivers/Src/main.cpp
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include "stm32f407xx.h"

void delay(uint32_t ticks)
{
	for(size_t i = 0; i < (ticks * 1000); i++);
}

int main(void)
{
	ADC_Init();
	Usart usart1 = Usart(USART_3);
	usart1.usart_init();

	Gpio::PinConfig_t intPinConf(PIN_1, INT_FT, PULL_UP, NO_AF);
	//Onboard button triggers interrupt. No pull up/pull down
	Gpio::PinConfig_t buttonConf(PIN_0, INT_FT, NO_PUPD);
	Gpio::PinConfig_t outputPinConf(PIN_15, OUTPUT);
	Gpio::PinConfig_t red(PIN_14, OUTPUT);
	Gpio::Handler_t intHandler(GPIOA, &intPinConf);
	Gpio::Handler_t buttonHandler(GPIOA, &buttonConf);
	Gpio::Handler_t outputHandler(GPIOD, &outputPinConf);
	Gpio::Handler_t redHandler(GPIOD, &red);
	Gpio::Init(&intHandler);
	Gpio::Init(&buttonHandler);
	Gpio::Init(&outputHandler);
	Gpio::Init(&redHandler);

	Gpio::WriteToOutputPin(GPIOD, PIN_15, SET);
	while(1)
	{
		uint32_t val = GPIOA->IDR & 0xffffffff;
		printf("Value %ld\n", val);
		usart1.puts("Ticker\n\r");
		delay(1000);
		Gpio::ToggleOutputPin(GPIOD, PIN_15);
	}
}



extern "C" {
	void EXTI0_IRQHandler(void)
	{
		RED_TOGGLE();
		usart3_puts("Test\n\r");
		if(EXTI->PR |= 1 << PIN_0)
		{
			CLR_EXTI_INT(PIN_0);
		}
	}
	void ADC_IRQHandler(void)
	{
		GREEN_TOGGLE();
		uint32_t val;
		if(ADC1->SR & (1 << 1))
		{
			val = ADC1->DR;
			printf("Val %ld\n", val);
		}
	}
}
